<a href="https://colab.research.google.com/github/XingxinHE/Python-for-Data-Analysis-Notes/blob/master/7_2_Data_Transformation.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

## Removing Duplicates

In [2]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
          'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [3]:
data.duplicated() #Ëøô‰∏™ÊòØÁúãÊØè‰∏ÄrowÊúâÊ≤°ÊúâduplicateÁöÑÔºå
#Á¨¶ÂêàÊù°‰ª∂ÊòØ‰ª•row‰∏∫Âü∫ÂáÜÔºå‰æãÂ¶ÇÊúÄÂêéÈÇ£‰∏ÄrowÔºåÂè™Âíårow 5‰∏ÄÊ†∑

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [4]:
data.drop_duplicates() #ÊääduplicateÁöÑrowÁªôdropÊéâ

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

‰ª•‰∏äËøô‰∫õÊñπÊ≥ïÈÉΩÊòØÈªòËÆ§ËÄÉËôëÊâÄÊúâcolumnsÁöÑÔºåÂΩìÁÑ∂‰Ω†ÂèØ‰ª•specify which column

In [5]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [6]:
data.drop_duplicates(['k1']) #Â¶ÇÊûúÂè™ËÄÉËôëk1ÁöÑËØùÔºåÈÇ£‰πà‰ªéÁ¨¨‰∏âË°åÂºÄÂßãÂ∞±Ë¢´Âà†Èô§‰∫Ü

    k1  k2  v1
0  one   1   0
1  two   1   1

In [7]:
data.drop_duplicates(['k1', 'k2'], keep='last')
#ÂΩìspecify‰∏§‰∏™columnÁöÑÊó∂ÂÄôÔºåË¶ÅÊª°Ë∂≥‰∏§‰∏™columnÈÉΩÊòØduplicateÊâçÂèØ‰ª•drop
#keep=lastÊòØ‰ªé‰∏ãÂºÄÂßãÊ£ÄÁ¥¢Ôºå‰øùÁïôÊúÄÂêéÈù¢ÁöÑÔºåÂà†Èô§ÂâçÈù¢ÂíåÂÆÉÈáçÂ§çÁöÑ

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

## Transforming Data Using a Function or Mapping
Ëøô‰∏™‰∏ìÈ¢òÂæàÈáçË¶ÅÔºåÂ∏∏Áî®Âà∞

In [8]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
           'Pastrami', 'corned beef', 'Bacon',
           'pastrami', 'honey ham', 'nova lox'],
           'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

Êàë‰ª¨ÈúÄË¶ÅÊääÊØèÁßçÈ£üÁâ©ÁöÑÂêçÂ≠óËΩ¨Êç¢ÊàêËÇâÁ±ªÔºåÊØîÂ¶ÇsalamiÊòØÁå™ËÇâ

In [9]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

ËøôÁßçÁªèÂÖ∏ÁöÑmap functionÈúÄË¶ÅÁöÑÊòØ‰∏Ä‰∏™dict

ÂΩìËøôÈáåÊúâ‰∏™ÈóÆÈ¢òÔºåÂâçÈù¢dfÊüê‰∫õvalueÁöÑÂ§ßÂ∞èÂÜô‰∏ç‰∏ÄËá¥ÔºåÂ¶ÇbaconÂíåBaconÔºåËøôÂú®data cleaningÈáåÈù¢ÁªèÂ∏∏Á¢∞Âà∞ÔºåÈúÄË¶ÅÂÅö‰ª•‰∏ãÊìç‰Ωú

In [10]:
lowercased = data['food'].str.lower() #Â∞Üfood columnËΩ¨Êç¢ÊàêÂ∞èÂÜôÊ†ºÂºè
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [11]:
data['animal'] = lowercased.map(meat_to_animal) #Âà©Áî®map functionÔºåÊääËÇâÁ±ªmapÂá∫Êù•
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

Êàë‰ª¨ÂèØ‰ª•Êää‰∏äÈù¢ÁöÑÂá†‰∏™Ê≠•È™§Ê±áËÅöÊàê‰∏Ä‰∏™ÔºåÂæàÈáçË¶ÅÔºÅÂæàÂÖ≥ÈîÆÔºÅ

In [13]:
data['food'].map(lambda x: meat_to_animal[x.lower()])
#Ëß£ËØª‰∏äÈù¢ËøôÊÆµ‰ª£Á†ÅÔºö
#ÂØπdata['food']ËøõË°åmap functionÔºå map(function)
#Ëøô‰∏™functionÊòØ‰ªÄ‰πàÔºü
#ÊòØ‰∏Ä‰∏™ÂåøÂêçÂáΩÊï∞lambda x
#lambda x ÊòØÊää x.lower()Â∞èÂÜôÁöÑxÔºå‰πüÂ∞±ÊòØdata['food']ÁöÑvalue ÂÜôÂÖ•meat_to_animalËøô‰∏™dict
#Âõ†‰∏∫ÂÜôÂÖ•ÁöÑÊòØkey,ÊâÄ‰ª•returnÁöÑÊòØmeat_to_animalÁöÑvalueÔºåÂç≥ËÇâÁ±ª

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

üåü**Using map is a convenient way to perform element-wise transformations and other data cleaning-related operations!!!!!!!!**

## Replacing Values
.replace()

In [14]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [16]:
data.replace(-999, np.nan) #ÁªèÂ∏∏‰ºöÁî®Âà∞replaceÔºå‰æãÂ¶ÇËøô‰∏™seriesÁöÑ-999ÊòéÊòæÊòØoutlierÔºåÊâÄ‰ª•Ë¶ÅreplaceÊéâ

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [17]:
data.replace([-999, -1000], np.nan) #replaceÂ§ö‰∏™value

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [18]:
data.replace([-999, -1000], [np.nan, 0]) #2ÂØπ2ÁöÑreplaceÔºåÂâçÊèêÊòØË¢´replaceÂíåreplaceÁâ©ÁöÑshape‰∏ÄËá¥

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [19]:
data.replace({-999: np.nan, -1000: 0}) #ËøôÁßçÁî®dictÁöÑÊñπÊ≥ïÊúÄÁ®≥Â¶•

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## Renaming Axis Indexes

In [20]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
          index=['Ohio', 'Colorado', 'New York'],
          columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

‰∏ÄÁßçÊñπÊ≥ïÊòØËÆæÂÆö‰∏Ä‰∏™functionÔºåÁÑ∂ÂêémapËøô‰∏™functionÊù•‰øÆÊîπÂêçÂ≠ó

In [21]:
transform = lambda x: x[:4].upper() #ÂèñÂâç4‰∏™Â≠óËäÇÔºåÁÑ∂ÂêéÂ§ßÂÜôÂÆÉ‰ª¨
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [23]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

‰∏äÈù¢ÁöÑÊñπÊ≥ïÊØîËæÉÁ¥ØËµòÔºåÂ¶ÇÊûúÂè™ÊòØmodifyÊ†áÈ¢òÁöÑÂ§ßÂ∞èÂÜôÁöÑËØùÔºåÂõ†‰∏∫pandas‰∏∫Ê≠§ËÆæËÆ°‰∫ÜÊõ¥Êñπ‰æøÁöÑfunction

.rename()

In [24]:
data.rename(index=str.title, columns=str.upper) #ËøôÁúüÁöÑÂº∫Ôºå‰∏ÄË°å‰ª£Á†ÅËß£ÂÜ≥‰∫ÜrowÂíåcolumnÁöÑrename

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [25]:
#ÂêåÁêÜÔºårename‰πüÂèØ‰ª•Êé•Âèó‰∏Ä‰∏™dict
data.rename(index={'OHIO': 'INDIANA'},
      columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [26]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
#inplaceÂ∞±ÊòØÁõ¥Êé•‰øÆÊîπÂéüdf

In [27]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

## Discretization and Binning

Continuous data is often discretized or otherwise separated into "bins" for analysis. Suppose you have data about a group of people in a study, and you want to group them into discrete age buckets

ËøûÁª≠ÁöÑÊï∞ÊçÆÈÄöÂ∏∏Ë¢´Á¶ªÊï£ÂåñÊàñ‰ª•ÂÖ∂‰ªñÊñπÂºèÂàÜÁ¶ªÊàê "bin"ËøõË°åÂàÜÊûê„ÄÇÂÅáËÆæÂú®‰∏ÄÈ°πÁ†îÁ©∂‰∏≠Ôºå‰Ω†Êúâ‰∏ÄÁæ§‰∫∫ÁöÑÊï∞ÊçÆÔºå‰Ω†ÊÉ≥Êää‰ªñ‰ª¨ÂàÜÊàêÁ¶ªÊï£ÁöÑÂπ¥ÈæÑÊÆµ„ÄÇ

ËØ¥Â§ßÁôΩËØùÁÇπÔºåÂ∞±ÊòØÊää‰∏Ä‰∏™continuousÁöÑdataÂàÜÊàêÊÆµ(bin)

pd.cut()

In [28]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32] #Á¶ªÊï£ÂåñÁöÑÊï∞Â≠ó
bins = [18, 25, 35, 60, 100] #binÁöÑdomain

In [29]:
cuts = pd.cut(ages, bins)
cuts #ÂèØ‰ª•ÁúãÂà∞ÂêÑÊï∞ÂÄºÂàÜÂ∏ÉÂú®Âì™‰∫õdomain‰πãÈó¥

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

outputÊòØ‰∏Ä‰∏™ÁâπÊÆäÁöÑcategoriesÁöÑobject type

In [30]:
cuts.codes #ÁúãÁúãÂÖ∑‰ΩìÂú®Âì™‰∏™ÂàÜÂå∫ÔºåÊØîÂ¶ÇÁ¨¨‰∏Ä‰∏™(18,25]ÊòØÁ¨¨‰∏Ä‰∏™ÂàÜÂå∫ÔºåÊâÄ‰ª•‰∏∫0

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [32]:
cuts.categories #Ëøô‰∏™ÂàôÊòØËøòÂéüÂú®Âì™‰∏™ÂàÜÂå∫

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [33]:
pd.value_counts(cuts) #Ëøô‰∏™ÂèØ‰ª•Êääcodes&categoriesÁªüÂêàÂú®‰∏ÄËµ∑ÔºåÁúãÂêÑÂàÜÂå∫ÈÉΩÊúâÂ§öÂ∞ë‰∏™

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

( means open,  [ means inclusiveÔºåËøô‰∏™ÂèØ‰ª•changeÁöÑ

In [34]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

Êé•‰∏ãÊù•Â∞±ÁâõÈÄº‰∫ÜÔºåÊàë‰ª¨ÊääÂπ¥ÈæÑÊÆµÂàÜÂá∫Êù•‰πãÂêéÔºåËÇØÂÆö‰ºöÊääËøô‰∫õÂπ¥ÈæÑÊÆµÂëΩÂêçÂòõÔºåÂ¶Ç‰∏ã

In [35]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

ÂâçÈù¢ÊèêÂà∞ÁöÑÊòØpd.cut(ÂÄºÔºåÂàíÂàÜÁöÑÂå∫Èó¥Ôºâ

ËøòÊúâ‰∏ÄÁßçÊñπÊ≥ïÊòØpd.cutÔºàÂÄºÔºåÂ§öÂ∞ë‰∏™Âå∫Èó¥ÔºâÔºåËøôÁßçÊñπÊ≥ïÁ±ª‰ºº‰∫égrasshopperÁöÑdivide domain

In [36]:
data = np.random.rand(20)
data

array([0.33116313, 0.4816452 , 0.39264393, 0.68744012, 0.31096172,
       0.66502406, 0.48679187, 0.46737955, 0.34916652, 0.80639632,
       0.5535195 , 0.04281284, 0.29324093, 0.44839778, 0.995994  ,
       0.935461  , 0.88781025, 0.93660602, 0.17922879, 0.7414792 ])

In [37]:
pd.cut(data, 4, precision=2) #ÊääËøô‰∫õÂÄºÁªüËÆ°Âá∫Êù•boundsÊòØÂ§öÂ∞ëÔºàGHÁöÑÊÄùÊÉ≥ÔºâÔºåÁÑ∂ÂêéÊääËøô‰∏™boundsÂæóÂá∫Êù•ÁöÑdomain / 4
#precisionÊòØÁ≤æÁ°ÆÂà∞ÊúÄÂêéÂá†‰ΩçÊï∞

[(0.28, 0.52], (0.28, 0.52], (0.28, 0.52], (0.52, 0.76], (0.28, 0.52], ..., (0.76, 1.0], (0.76, 1.0], (0.76, 1.0], (0.042, 0.28], (0.52, 0.76]]
Length: 20
Categories (4, interval[float64]): [(0.042, 0.28] < (0.28, 0.52] < (0.52, 0.76] < (0.76, 1.0]]

‰∏äÊñáÊèêÂèäÁöÑÊòØdivide domainÁöÑÊñπÊ≥ïÔºå ‰∏ãÈù¢ÂàôÊòØÊ†πÊçÆËæìÂÖ•valueÁöÑÊï∞ÁõÆËøõË°åÁ≠âÂàÜÔºåÁ±ª‰ºº‰∫éGHÁöÑpartition list

pd.qcut()                       
qÊòØquantilesÁöÑÊÑèÊÄù

In [40]:
data = np.random.randn(1000) # Normally distributed
cuts = pd.qcut(data, 4) # Cut into quartiles

In [41]:
cuts

[(-0.744, -0.0376], (-0.0376, 0.601], (0.601, 2.905], (0.601, 2.905], (0.601, 2.905], ..., (-3.8489999999999998, -0.744], (-3.8489999999999998, -0.744], (-0.744, -0.0376], (0.601, 2.905], (0.601, 2.905]]
Length: 1000
Categories (4, interval[float64]): [(-3.8489999999999998, -0.744] < (-0.744, -0.0376] < (-0.0376, 0.601] <
                                    (0.601, 2.905]]

In [42]:
pd.value_counts(cuts)
#ÂèØ‰ª•ÁúãÂà∞ÔºåÂÆÉËá™Âä®ÂèñÂÄº‰∫Ü4‰∏™Âå∫Èó¥ÔºåËÆ©ÊØè‰∏™Âå∫Èó¥ÈÉΩÊòØ250‰∏™item

(0.601, 2.905]                   250
(-0.0376, 0.601]                 250
(-0.744, -0.0376]                250
(-3.8489999999999998, -0.744]    250
dtype: int64

## Detecting and Filtering Outliers